{
  "Isia Vann": "Isia Vann is an employee from security department of GASTech. He is the brother of Juliana Vann who died at the age of 10 due to chemical outlet from the factory. Thus making him a suspect of kidnapping case as he has a strong motive for it. ARISE, is a publication magazine by the APA. He is involved in forwarding and interacting of mails that have ARISE as the subject making it a potential suspicious mail. With Isia Vann, being a member of PoK this makes this a possible mail thread used for communication regarding the kidnapping.",
  "Loreto Bodrogi": "Loreto Bodrogi is an employee from security department of GASTech. Loreto Bodrogi sent a mail with subject as security procedures for january 20 vip visit on 14th. Interestingly, a mail with same subject was sent by Edvard Vann to several people on the 9th and the mail on the 14th did not include Edvard Vann. This raises a suspicion that may be the same subjects that were used before were used to converse about the kidnapping event in code words.",
  "Minke Mies" : "Minke Mies is an employee from security department of GASTech. Minke Mies was recipient of several suspicious mail threads. This combined with him having the same last name as one of the PoK members raises a doubt about him having a potential unofficial relationship with PoK and other entities.",
  "Ruscella Mies Haber" : "Ruscella Mies Haber is a member from the Engineering Department of GASTech. The Asterian People's Army (APA) is a paramilitary organization which has been engaged in terrorist activities funded through its criminal enterprises, which include drug trafficking.  In recent years the APA has sought to build their brand through websites and the publication of a professional, high-quality magazine called \"Arise\" She has sent mail regarding ARISE - Inspiration for defenders of Kronos to few employees in GASTech, thus making her a suspicious candidate for kidnapping. Mails about virus detected on system were first sent from Linnea Bergen from Information Technology department to Ruscella Mies Haber till 14:33 on 14th January 2022. But the replies fro this mail subject were sent to Loreto Bodrogi, Isia Vann, Inga Ferro, Hennie Osvaldo, Minke Mies (all of them workin the security department) as a group mail which seems to suspicious, it also seems like virus could be a code word for some confidential topic they were speaking about.",
  "Henk Mies" : "Henk Mies is an employee in facilities department of GASTech. His last name along with his date of joining GASTech makes us suspicious of his connections with PoK. But he was not part of the pool of the suspicious mail threads which we identified in our analysis.",
  "Hennie Osvaldo": "Hennie Osvaldo is an employee from security department of GASTech. He has the same surname as a member from Protector of Kronos, thus making him a potential suspect for kidnapping of officials. Mails about virus detected on system were first sent from Linnea Bergen from Information Technology department to Hennie Osvaldo till 14:33 on 14th January 2022. But the replies fro this mail subject were sent to Loreto Bodrogi, Isia Vann, Inga Ferro, Ruscella Mies Haber, Minke Mies (all of them work in the security department) as a group mail which seems to suspicious, it also seems like virus could be a code word for some confidential topic they were speaking about. Mails about ARISE (which is a magazine maintained by Asterian People's Army) were also sent to and fro between Loreto Bodrogi, Isia Vann, Inga Ferro, Ruscella Mies Haber, Hennie Osvaldo leading to the doubt they might be a clique of people responsible for kidnapping.",
  "Edvard Vann": "Edvard Vann is an employee from the Security department of GASTech. He has the same surname as few members from Protector of Kronos, thus making him a potential suspect for kidnapping of officials. But the mails he sent or received are mostly regarding security procedures for 20 January vip visit, that to within the people from the security department. This shows that he might not be the culprit whom we are searching in the kidnapping case."
}